["If your brain was dynamite, there wouldn’t be enough to blow your hat off.",
"Aww, it’s so cute when you try to talk about things you don’t understand.",
"Beauty is only skin deep, but ugly goes clean to the bone.",
"Child, I’ve forgotten more than you ever knew.",
"Did I invite you to the barbecue? Then why are you all up in my grill?",
"Don’t be ashamed of who you are. That’s your parent’s job.",
"Don’t hate me because I’m beautiful. Hate me because your boyfriend thinks so.",
"Don’t worry about me. Worry about your eyebrows.",
"Don’t you get tired of putting makeup on your two faces every morning?",
"Earth is full. Go home.",
"Good story, but in what chapter do you shut up?",
"Grab a straw, because you suck.",
"Hold still. I’m trying to imagine you with personality.",
"I am returning your nose. I found it in my business.",
"I believed in evolution until I met you.",
"I could eat a bowl of alphabet soup and poop out a smarter statement than whatever you just said.",
"I hope your wife brings a date to your funeral.",
"I thought of you today. It reminded me to take out the trash.",
"I told my therapist about you.",
"I was today years old when I realized I didn’t like you.",
"I will ignore you so hard you will start doubting your existence.",
"I’d give you a nasty look, but you’ve already got one.",
"I’d slap you but I don’t want to make your face look any better.",
"I’ll never forget the first time we met. But I’ll keep trying.",
"I’m not insulting you, I’m describing you.",
"I’ve been called worse by better.",
"If genius skips a generation, your children will be brilliant.",
"If I wanted to hear from an asshole, I’d fart.",
"If ignorance is bliss, you must be the happiest person on the planet.",
"If laughter is the best medicine, your face must be curing the world.",
"If you were an inanimate object, you’d be a participation trophy.",
"If you’re going to be two-faced, at least make one of them pretty.",
"Isn’t there a bullet somewhere you could be jumping in front of?",
"Jealousy is a disease. Get well soon.",
"Jesus might love you, but everyone else definitely thinks you’re an idiot.",
"Keep rolling your eyes, you might eventually find a brain.",
"Light travels faster than sound which is why you seemed bright until you spoke.",
"May both sides of your pillow be uncomfortably warm.",
"Oh, I’m sorry. Did the middle of my sentence interrupt the beginning of yours?",
"Oh, you don’t like being treated the way you treat me? That must suck.",
"People like you are the reason God doesn’t talk to us anymore.",
"Please just tell me you don’t plan to home-school your kids.",
"Stupidity isn’t a crime, so you’re free to go.",
"Take my lowest priority and put yourself beneath it.",
"That sounds like a you problem.",
"The people who tolerate you on a daily basis are the real heroes.",
"There are some remarkably dumb people in this world. Thanks for helping me understand that.",
"Too bad you can’t Photoshop your ugly personality.",
"Unless your name is Google, stop acting like you know everything!",
"Were you born this stupid or did you take lessons?",
"What doesn’t kill you, disappoints me.",
"Who ate your bowl of sunshine this morning, thundercloud?",
"You are a pizza burn on the roof of the world’s mouth.",
"You are more disappointing than an unsalted pretzel.",
"You are proof that evolution can go in reverse.",
"You are the human version of period cramps.",
"You bring everyone so much joy when you leave the room.",
"You fear success, but you really have nothing to worry about.",
"You have miles to go before you reach mediocre.",
"You look like a ‘before’ picture.",
"You see that door? I want you on the other side of it.",
"You should really come with a warning label.",
"You’re about as useful as a screen door on a submarine.",
"You’re about as useful as an ashtray on a motorcycle.",
"You’re impossible to underestimate.",
"You’re my favorite person… besides every other person I’ve ever met.",
"You’re the reason God created the middle finger.",
"Your face makes onions cry.",
"Your kid is so annoying, he makes his Happy Meal cry.",
"Your only purpose in life is to become an organ donor.",
"Your secrets are always safe with me. I never even listen when you tell me them.",
"Are you almost done with all of this drama? Because I need an intermission.",
"Are you ever overwhelmed with the urge to tell someone to shut up? Because that’s how I feel right now.",
"As an outsider, what do you think of the human race?",
"Brains aren’t everything. In your case, they’re nothing.",
"Bye, hope to see you never.",
"Bye. Hope to see you never.",
"Calling you an idiot would be an insult to all stupid people.",
"Complete this sentence for me: “I never want to see you ————!”",
"Did the mental hospital test too many drugs on you today?",
"Did your parents ever ask you to run away from home?",
"Do your parents even realize they’re living proof that two wrongs don’t make a right?",
"Don’t blame me for your stupidity. Take that up with your mom and dad.",
"Don’t feel bad. A lot of people have no talent.",
"Don’t get bitter, just get better.",
"Don’t hate me because you ain’t me.",
"Don’t try to think too hard. You’re so stupid it might sprain your brain.",
"Don’t worry, the first 40 years of childhood are always the hardest.",
"Everyone’s entitled to act stupid once in a while, but you really abuse the privilege.",
"Feed your own ego. I’m busy.",
"First off: Brush your teeth.",
"Have a nice day, somewhere else.",
"Her teeth were so bad she could eat an apple through a fence.",
"Hey, you have something on your chin. No, the 3rd one down.",
"Hey, your village called – they want their idiot back.",
"How many licks till I get to the interesting part of this conversation?",
"How many licks until I get to the interesting part of this conversation?",
"How much of a refund do you expect on your head, since it’s empty?",
"I bet your parents change the subject when their friends ask about you.",
"I do not consider you a vulture. I consider you something a vulture would eat.",
"I don’t have the patience or the crayons to explain this to you.",
"I don’t have the time or the crayons to explain this to you.",
"I don’t know what your problem is, but I’m guessing it’s hard to pronounce.",
"I envy people who have never met you.",
"I farted. That’s as close as you’re going to get to me giving a shit.",
"I find the fact that you’ve lived this long both surprising and disappointing.",
"I forgot the world revolves around you. My apologies, how silly of me.",
"I have seen people like you. But I had to pay admission.",
"I hope your next blowjob is from a shark.",
"I know you are, but what am I?",
"I like the way you try.",
"I look ugly? Good. I was trying to look like you today.",
"I love what you’ve done with your hair. How do you get it to come out of the nostrils like that?",
"I love what you’ve done with your hair. How do you get it to come out of your nostrils like that?",
"I may love to shop but I will never buy your bull.",
"I may love to shop, but I will never buy your bull.",
"I only take you everywhere I go, so I don’t have to kiss you goodbye.",
"I see no evil, and I definitely don’t hear your evil.",
"I treasure the time I don’t spend with you.",
"I was going to make a joke about your life, but I see life beat me to the punch.",
"I was hoping for a battle of wits but you appear to be unarmed.",
"I will slap you so hard even Google won’t be able to find you.",
"I wish I had a flip phone, so I could slam it shut on this conversation.",
"I would never date you. I’m lonely, not desperate.",
"I would prefer a battle of wits, but you appear unarmed.",
"I’d agree with you but then we’d both be wrong.",
"I’d like to help you out. Which way did you come in?",
"I’d rather treat my baby’s diaper rash than have lunch with you.",
"I’d say you’re ‘dumb as a rock,’ but at least a rock can hold a door open.",
"I’m an acquired taste. If you don’t like me, acquire some taste.",
"I’m busy right now, can I ignore you another time?",
"I’m busy right now; can I ignore you another time?",
"I’m glad to see you’re not letting education get in the way of your ignorance.",
"I’m jealous of all the people who haven’t met you.",
"I’m just glad that you’re stringing words into sentences now.",
"I’m not a nerd. I’m just smarter than you.",
"I’m not a proctologist but I know an asshole when I see one.",
"I’ve been called worse things by better men.",
"I’ve seen people like you before, but I had to pay admission.",
"If I had a dollar for every time you said something smart, I’d be broke.",
"If I had a face like yours, I would sue my parents.",
"If I said anything to offend you it was purely intentional.",
"If I threw a stick, you’d leave, right?",
"If I throw a stick, will you leave?",
"If I wanted to kill myself, I would climb to your ego and jump to your IQ.",
"If you have a problem with me, write the problem on a piece of paper, fold it, and shove it up your ass.",
"If you want to be a smartass, you have to be smart. Otherwise, you’re just an ass.",
"If you were the light at the end of the tunnel, I’d turn back around.",
"If you’re going to act like a turd, go lay in the yard.",
"If you’re going to act like a turd, go lay on the yard.",
"In the land of the witless, you would be king.",
"Isn’t it dangerous to use your whole vocabulary in one sentence?",
"It’s impossible to underestimate you.",
"It’s kind of hilarious watching you try to fit your entire vocabulary into one sentence.",
"Make you should eat makeup so you’re pretty on the inside.",
"Mirrors can’t talk. Lucky for you, they can’t laugh, either.",
"Mister Rogers would be disappointed with you.",
"My days of not taking you seriously are certainly coming to a middle.",
"My straightener is hotter than you.",
"N’Sync said it best, “BYE, BYE, BYE!”",
"N’Sync said it best: “BYE, BYE, BYE.”",
"No matter how much a snake sheds its skin, it’s still a snake.",
"Of course I’m talking like an idiot… how else could you understand me?",
"OH MY GOD! IT SPEAKS!",
"Oh, I’m sorry. I offended you with my opinion? You should hear the ones I keep to myself.",
"One day, I hope you’ll choke on the crap you talk.",
"Oops, my bad. I could’ve sworn I was dealing with an adult.",
"Our kid must have gotten his brain from you! I still have mine.",
"People clap when they see you. They clap their hands over their eyes.",
"People like you are the reason I’m on medication.",
"Remember that time you were saying that thing I didn’t care about? Yeah, that is now.",
"Remember that time you were saying that thing I didn’t care about? Yeah… that is now.",
"Remember when I asked for your opinion? Me neither.",
"Since you know it all, you should know when to shut up.",
"Someday you’ll go far. And I really hope you stay there.",
"Someday you’ll go far. I hope you stay there.",
"Somewhere out there is a tree tirelessly producing oxygen for you. You owe it an apology.",
"Somewhere out there, there’s a tree working very hard to produce oxygen so that you can breathe. I think you should go and apologize to it.",
"Somewhere, somehow, you are robbing a village of their idiot.",
"Sorry, not sorry.",
"The last time I saw a face like yours, I fed it a banana.",
"The last time I saw something like you… I flushed.",
"The only way my husband would ever get hurt during an activity is if the TV exploded.",
"Two wrongs don’t make a right. Take your parents, for instance.",
"We were happily married for one month, but unfortunately, we’ve been married for 10 years.",
"Well, the jerk store called. They’re running out of you.",
"Were you born on the highway? That is where most accidents happen.",
"When I see your face, there’s not a thing that I would change… except the direction I was walking in.",
"When you look in the mirror, say hi to the clown you see in there for me, would you?",
"Where’d you get your clothes, girl, American Apparently Not?",
"Where’s your off button?",
"Wish I had a flip phone so I could slam it shut on this conversation.",
"Wow, your maker really didn’t waste time giving you a personality, huh?",
"Yeah? Well, you smell like hot dog water.",
"Yes, I am a bitch, just not yours.",
"You are like a cloud. When you disappear it’s a beautiful day.",
"You are like a cloud. When you disappear, it’s a beautiful day.",
"You are proof God has a sense of humor.",
"You are so full of shit, the toilet’s jealous.",
"You are the reason why shampoo has instructions.",
"You bring everyone so much joy! You know, when you leave the room. But, still.",
"You have a face only a mother could love.",
"You have an entire life to be an idiot. Why not take today off?",
"You have so many gaps in your teeth it looks like your tongue is in jail.",
"You have your entire life to be a jerk. Why not take today off?",
"You just might be why the middle finger was invented in the first place.",
"You look like something I would draw with my left hand.",
"You look like something that came out of a slow cooker.",
"You look so pretty. Not at all gross, today.",
"You must have been born on a highway. That’s where most accidents happen.",
"You need a kiss on the neck from a crocodile.",
"You should carry a plant around with you to replace the oxygen you waste.",
"You’re a bad person. Enough said.",
"You’re a conversation starter. Not when you are around, but once you leave.",
"You’re a gray sprinkle on a rainbow cupcake.",
"You’re a grey sprinkle on a rainbow cupcake.",
"You’re cute. Like my dog. He also always chases his tail for entertainment.",
"You’re cute. Like my dog. He also chases his tail for entertainment.",
"You’re like the end pieces of a loaf of bread. Everyone touches you, but nobody wants you.",
"You’re living proof it’s possible to live without a brain.",
"You’re not stupid! You just have bad luck when you’re thinking.",
"You’re the reason the gene pool needs a lifeguard.",
"You’re the reason this country has to put directions on shampoo.",
"You’re the type of person who can’t read the room. You don’t understand when you aren’t wanted.",
"Your ass must be pretty jealous of all the shit that comes out of your mouth.",
"Your face is just fine, but we’ll have to put a bag over that personality.",
"Your family tree must be a cactus ‘cause you’re all a bunch of pricks.",
"Your mama had an epic fail. You!",
"Your only chance of getting laid is to crawl up a chicken butt and wait."]